# PanelTypeSet Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelTypeSet Constructor
PanelTypeSet Class See Also
---
Initializes a new instance of the PanelTypeSet class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PanelTypeSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
PanelTypeSet()
```

# See Also
PanelTypeSet Class
Autodesk.Revit.DB Namespace